//Задание 1
//fun main() {
//    println("Введите операцию(Через пробелы)")
//    val operation = readln().split(' ')
//    val el1 = operation[0].toDouble()
//    val el2 = operation[1]
//    val el3 = operation[2].toDouble()
//    val result = when (el2) {
//        "+" -> el1 + el3
//        "-" -> el1 - el3
//        "/" -> el1 / el3
//        "*" -> el1 * el3
//        else -> ("Неизвестная операция: $el2")
//    }
//    println("Результат: $result")
//}

//Задание 2
//fun main() {
//    println("Введите слово для проверки на палиндром")
//    val pol = readln().lowercase()
//    val all = arrayOf("аа", "аба", "абба", "авва", "ага", "яя", "ада", "аза",
//        "акика", "ала", "алала", "амма", "анна", "апокопа", "ара", "арара", "ата",
//        "аша", "баб", "рер", "боб", "вдв", "гег", "ыыы", "гиг", "гэг", "дед",
//        "довод", "доход", "еже", "еле", "еле-еле", "еще", "заказ", "залаз", "зараз",
//        "иди", "или", "или-или", "иси", "ищи", "кабак", "казак", "как", "кек", "кик",
//        "кинк", "кок", "колок", "комок", "конок", "коток", "кудук", "лал", "лол",
//        "мадам", "мем", "мим", "мом", "моном", "наган", "нежен", "тет", "нойон",
//        "обо", "ого", "око", "ололо", "олололо", "ото", "покоп", "поп", "потоп",
//        "пуп", "радар", "ревер", "репер", "реппер", "ротатор", "ротор", "сос", "тет-а-тет", "тиллит", "топот", "тот", "тумут", "тут", "угу", "ушу", "цыц",
//        "шабаш", "шалаш", "шамаш", "шиш", "шорош", "шш", "ыгы", "язя", "оно", "ими",
//        "гг", "мм", "уху", "летел", "течет", "езде", "воров", "уму", "лишил",
//        "тащат", "лил", "мам", "ребер", "пап", "еше", "нон", "мкм", "сс", "учу",
//        "вв", "массам", "тет", "корок", "ава", "авава", "азиза", "алела", "алла",
//        "анона", "асса", "буб", "велев", "вив", "винив", "возов", "выбыв", "вымыв",
//        "вырыв", "днд", "заз", "икки", "киик", "килик", "кирк", "крк", "лабал",
//        "лакал", "лапал", "латал", "лисил", "ломол", "магам", "межем", "мечем",
//        "мирим", "моллом", "мытым", "мэм", "несен", "оао", "пп", "ремер", "рур",
//        "сортрос", "сэс", "танат", "таннат", "тартрат", "тат", "терет", "тит",
//        "тихит", "уау", "аникина", "анилина", "апопа", "аса", "аха", "водоводов",
//        "водородов", "водоходов", "волов", "гаг", "дуд", "еве", "ее", "ере", "жиж",
//        "иги", "иерее", "ижи", "имамы", "имащи", "итти", "ищущи", "йогой", "йотой",
//        "канак", "керек", "ковок", "копок", "косок", "котяток", "кошок", "лазал",
//        "левел", "мазам", "макам", "макакам", "малам", "мамам", "манам", "манекенам",
//        "маннам", "марам", "матам", "маттам", "махам", "мацам", "машам", "метем",
//        "мешем", "миним", "молом", "мелем", "момом", "мором", "мотом", "мотетом",
//        "мотоботом", "мохом", "наворов", "наддан", "насосан", "низин", "ножон",
//        "олифило", "пип", "сгс", "тенет", "теше", "тойота", "уду", "ужу", "удоду",
//        "узу", "уку", "улус", "уссу", "фиф", "хабах", "хавах", "хазах", "халлах",
//        "халалах", "хамах", "ханах", "харах", "хассах", "хатах", "хах", "хахах",
//        "хашах", "хашишах", "цац", "чач", "юлю", "явя", "яря", "ятя", "венев",
//        "игиги", "нин")
//    pol.reversed()
//    if (pol in all){
//        println("Слово ${pol.reversed()} является палиндромом")
//    }
//    else{
//        println("${pol.reversed()} явно не палиндром")
//    }
//}

//Задание 3

//1)
//fun calcoch(wins:Int,draw:Int,looose:Int):Int {
//    return wins*3+draw
//}
//fun main() {
//    println("Введите количество побед")
//    val wins= readln().toInt()
//    println("Введите количество ничей")
//    val draw = readln().toInt()
//    println("Введите количество поражений")
//    val looose = readln().toInt()
//    val points = calcoch(wins, draw, looose)
//    println("Команда заработала $points очков")
//}
//2)
//fun main1(n:MutableList<Int>):Int{
//    return n.min()
//}
//fun main() {
//    val n = mutableListOf<Int>()
//    println("Введите размер списка")
//    val size = readln().toInt()
//    println("Введите элементы списка")
//    for (i in 1..size){
//        val num = readln().toInt()
//        n.add(num)
//    }
//    val min = main1(n)
//    println(min)
//}
//3)
//fun main1 (a:Int,b:Int):Boolean{
//    if (a==b){
//        return true
//    }
//    else{
//        return false
//    }
//}
//fun main() {
//    println("Напишите 2 числа через enter")
//    val a = readln().toInt()
//    val b = readln().toInt()
//    val g = main1(a,b)
//    if (g == true){
//        println("Числа равны друг другу")
//    }
//    else println("Числа не равны друг другу")
//}


//Задание 4
//import kotlin.random.Random
//fun game(playerHand: Int, dealerHand: Int): String {
//    return when {
//        playerHand == 21 -> "Вы победили"
//        dealerHand == 21 -> "Диллер победил"
//        playerHand > 21 -> "Вы проиграли"
//        dealerHand > 21 -> "Диллер проиграл"
//        playerHand > dealerHand -> "Вы победили"
//        playerHand < dealerHand -> "Диллер победил"
//        else -> "Ничья"
//    }
//}
//fun main() {
//    println("Введите 1, если хотите играть, 2 если хотите выйти")
//    while (true) {
//        val newGame = readLine() ?: continue
//        when (newGame) {
//            "1" -> break
//            "2" -> {
//                println("До свидания")
//                return
//            }
//        }
//    }
//    var playerHand = 0
//    for (i in 1..2) {
//        playerHand += Random.nextInt(1, 11)
//    }
//    println("У вас на руках $playerHand очков")
//    var dealerHand = 0
//    for (i in 1..2) {
//        dealerHand += Random.nextInt(1, 11)
//    }
//    println("У дилера $dealerHand очков")
//    while (true) {
//        println("Вы хотите взять еще карту?(1 - да, 2 - нет )")
//        val playerTake = readLine()!!.toInt()
//        if (playerTake == 1) {
//            playerHand += Random.nextInt(1, 11)
//            println("У вас на руках $playerHand очков")
//            if (playerHand > 21) {
//                println("Вы проиграли. У вас слишком много очков:$playerHand")
//                return
//            }
//        } else {
//            break
//        }
//    }
//    while (dealerHand < 17) {
//        println("Диллер берёт карту, у него $dealerHand очков")
//        dealerHand += Random.nextInt(1, 11)
//    }
//    println("Диллер остановился с $dealerHand очков")
//    val gameWinner = game(playerHand, dealerHand)
//    println(gameWinner)
//}

